{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_1"
            },
            {
                "class_name": "DropoutNoScaleForBinary",
                "config": {
                    "name": "drop0",
                    "noise_shape": null,
                    "rate": 0.2,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "drop0"
            },
            {
                "class_name": "BinaryDense",
                "config": {
                    "H": 1.0,
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_lr_multiplier": null,
                    "bias_regularizer": null,
                    "kernel_constraint": {
                        "class_name": "Clip",
                        "config": {
                            "max_value": 1.0,
                            "min_value": -1.0
                        }
                    },
                    "kernel_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 1.0,
                            "minval": -1.0,
                            "seed": null
                        }
                    },
                    "kernel_lr_multiplier": 1.0,
                    "kernel_regularizer": null,
                    "name": "dense1",
                    "trainable": true,
                    "units": 128,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "drop0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 1e-06,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.9,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "binary_tanh",
                    "name": "act1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "act1"
            },
            {
                "class_name": "DropoutNoScaleForBinary",
                "config": {
                    "name": "drop1",
                    "noise_shape": null,
                    "rate": 0.5,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "act1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "drop1"
            },
            {
                "class_name": "BinaryDense",
                "config": {
                    "H": 1.0,
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_lr_multiplier": null,
                    "bias_regularizer": null,
                    "kernel_constraint": {
                        "class_name": "Clip",
                        "config": {
                            "max_value": 1.0,
                            "min_value": -1.0
                        }
                    },
                    "kernel_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 1.0,
                            "minval": -1.0,
                            "seed": null
                        }
                    },
                    "kernel_lr_multiplier": 1.0,
                    "kernel_regularizer": null,
                    "name": "dense2",
                    "trainable": true,
                    "units": 128,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "drop1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense2"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 1e-06,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.9,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn2",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "binary_tanh",
                    "name": "act2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "act2"
            },
            {
                "class_name": "DropoutNoScaleForBinary",
                "config": {
                    "name": "drop2",
                    "noise_shape": null,
                    "rate": 0.5,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "act2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "drop2"
            },
            {
                "class_name": "BinaryDense",
                "config": {
                    "H": 1.0,
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_lr_multiplier": null,
                    "bias_regularizer": null,
                    "kernel_constraint": {
                        "class_name": "Clip",
                        "config": {
                            "max_value": 1.0,
                            "min_value": -1.0
                        }
                    },
                    "kernel_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 1.0,
                            "minval": -1.0,
                            "seed": null
                        }
                    },
                    "kernel_lr_multiplier": 1.0,
                    "kernel_regularizer": null,
                    "name": "dense3",
                    "trainable": true,
                    "units": 128,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "drop2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense3"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 1e-06,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.9,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn3",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn3"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "binary_tanh",
                    "name": "act3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "act3"
            },
            {
                "class_name": "DropoutNoScaleForBinary",
                "config": {
                    "name": "drop3",
                    "noise_shape": null,
                    "rate": 0.5,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "act3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "drop3"
            },
            {
                "class_name": "BinaryDense",
                "config": {
                    "H": 1.0,
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_lr_multiplier": null,
                    "bias_regularizer": null,
                    "kernel_constraint": {
                        "class_name": "Clip",
                        "config": {
                            "max_value": 1.0,
                            "min_value": -1.0
                        }
                    },
                    "kernel_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 1.0,
                            "minval": -1.0,
                            "seed": null
                        }
                    },
                    "kernel_lr_multiplier": 1.0,
                    "kernel_regularizer": null,
                    "name": "dense",
                    "trainable": true,
                    "units": 10,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "drop3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "epsilon": 1e-06,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.9,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn"
            }
        ],
        "name": "model_1",
        "output_layers": [
            [
                "bn",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.4"
}
